[
    {
        "id": "c26d113f55b8",
        "title": "How We Make Smoked Gouda Turkey Burger",
        "keywords": [
            "food",
            "recipe"
        ],
        "summary": "The Smoked Gouda Turkey Burger is a tasty recipe that combines turkey, smoked Gouda, bacon, peppadew, tomato, red onion, spring greens, and spicy mayo. It's easy to make and full of flavor.",
        "content": "If you're looking for a delicious and satisfying burger recipe, look no further than the Smoked Gouda Turkey Burger. This recipe combines the smoky flavors of Gouda cheese and bacon with the spiciness of peppadew peppers and spicy mayo to create a mouthwatering burger that is sure to impress. To start, you'll need to gather your ingredients. You'll need ground turkey, smoked Gouda cheese, bacon, peppadew peppers, tomato, red onion, spring greens, and spicy mayo. You can find most of these ingredients at your local grocery store, and the others can be found at specialty stores or online. Once you have your ingredients, it's time to start cooking. Begin by preheating your grill or stovetop grill pan to medium-high heat. While the grill is heating up, form your ground turkey into four equal-sized patties and season them with salt and pepper. Next, cook your bacon until it is crispy, then set it aside. Slice your smoked Gouda cheese into thin slices, and set it aside as well. When your grill is hot, place your turkey patties on the grill and cook for about 5-7 minutes per side, or until they are cooked through and no longer pink in the center. During the last minute of cooking, top each patty with a slice of smoked Gouda cheese and allow it to melt. While your burgers are cooking, prepare your toppings. Slice your tomato and red onion into thin rounds, and chop your peppadew peppers into small pieces. To make the spicy mayo, mix together mayo and your favorite hot sauce or chili paste. When your burgers are done cooking, remove them from the grill and let them rest for a few minutes. While they are resting, assemble your toppings. Spread a generous amount of spicy mayo on the bottom bun of each burger, then top with a cooked turkey patty and a slice of bacon. Add a few slices of tomato and red onion, a handful of spring greens, and a sprinkle of chopped peppadew peppers. Finish off your burgers with the top bun, and serve immediately. The combination of smoky Gouda cheese, crispy bacon, spicy mayo, and fresh toppings makes for a truly delicious and satisfying burger that is perfect for any occasion. In conclusion, the Smoked Gouda Turkey Burger is a must-try recipe for any burger lover. It's easy to make, packed with flavor, and sure to impress your family and friends. So fire up the grill and give this recipe a try – you won't be disappointed!",
        "headerImageURL": "news/how-we-make-smoked-gouda-turkey-burger-c26d113f55b8.webp",
        "URL": ""
    },
    {
        "id": "af0ed6d182e2",
        "title": "Get 20% Discount at Your Birthday Event for $20 Spend",
        "keywords": [
            "news",
            "discount",
            "birthday"
        ],
        "summary": "FoodHub is offering a 20% discount on orders of $20 or more for your birthday. Use promo code BIRTHDAY20 at checkout.",
        "content": "If you're looking to celebrate your birthday with some delicious food, look no further than our online fast food restaurant! We're excited to offer a special birthday offer for our valued customers: get 20% off your order when you spend $20 or more. Here's how it works: simply place your order on our website or app, and enter the promo code BIRTHDAY20 at checkout. As long as your order totals $20 or more, you'll automatically receive a 20% discount on your entire order. It's that easy! This offer is our way of saying thank you for choosing our restaurant for your special day. We know that birthdays are a time to celebrate with friends and family, and we want to help make your celebration even more special with our delicious food and great discount. Our menu is packed with tasty options that are sure to please everyone in your party. From classic burgers and fries to fresh salads and sandwiches, we've got something for everyone. And don't forget to add on some of our famous sides, like crispy onion rings or creamy mac and cheese. Plus, ordering online is easy and convenient. Simply visit our website or download our app to place your order from the comfort of your own home. You can even schedule your order in advance, so everything is ready to go when you arrive. So what are you waiting for? Celebrate your birthday in style with our delicious food and great discount. Just remember to use the promo code BIRTHDAY20 at checkout to receive your 20% off discount when you spend $20 or more. We can't wait to help make your special day even more memorable!",
        "headerImageURL": "news/get-20-discount-at-your-birthday-event-for-20-spend-af0ed6d182e2.jpg",
        "URL": ""
    },
    {
        "id": "2d306e2c7fa8",
        "title": "Strawberry Smoothie is the Best Beverage for Your Hot Days",
        "keywords": [
            "beverage",
            "smoothie"
        ],
        "summary": "A strawberry smoothie is a delicious and healthy beverage that's easy to make with a blender. It's packed with antioxidants, vitamins, and nutrients, making it the perfect drink for hot summer days.",
        "content": "When the weather heats up, there's nothing quite like a cold and refreshing beverage to help you cool down. While there are plenty of options out there, we believe that the strawberry smoothie is the best choice for those hot summer days. Not only is a strawberry smoothie delicious, but it's also packed with health benefits. Strawberries are rich in antioxidants, which can help protect your body against inflammation and disease. They're also a good source of vitamin C, fiber, and potassium, which can all help improve your overall health. When you make a strawberry smoothie, you have the option to add other healthy ingredients as well. For example, you can add some Greek yogurt for an extra boost of protein and calcium, or some spinach for added nutrients. You can also sweeten your smoothie with honey or maple syrup instead of sugar. Another great thing about strawberry smoothies is that they're easy to make. All you need are a few simple ingredients and a blender, and you can whip up a delicious and nutritious smoothie in just a few minutes. Plus, you can customize your smoothie to your liking by adjusting the amount of fruit, liquid, and other ingredients. If you're looking for some inspiration for your next strawberry smoothie, here are a few ideas to get you started: Classic Strawberry Smoothie: Blend together strawberries, Greek yogurt, milk, and honey for a simple and delicious smoothie. Strawberry Banana Smoothie: Add a banana to your strawberry smoothie for some extra sweetness and creaminess. Green Strawberry Smoothie: Blend together strawberries, spinach, banana, and almond milk for a healthy and refreshing smoothie. In conclusion, a strawberry smoothie is the perfect beverage for hot summer days. It's delicious, nutritious, and easy to make, with plenty of options for customization. So next time you're looking for a refreshing drink to cool you down, reach for a strawberry smoothie.",
        "headerImageURL": "news/strawberry-smoothie-is-the-best-beverage-for-your-hot-days-2d306e2c7fa8.jpg",
        "URL": ""
    }
]